In [4]:
library(tidyverse)
library(repr)
library(digest)
library(infer)
library(gridExtra)
library(taxyvr)
library(cowplot)

In [5]:
original_data <- read_csv("ds_salaries.csv")
head(original_data)

New names:
• `` -> `...1`
Rows: 607 Columns: 12
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (7): experience_level, employment_type, job_title, salary_currency, empl...
dbl (5): ...1, work_year, salary, salary_in_usd, remote_ratio

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

  ...1 work_year experience_level employment_type job_title
1 0    2020      MI               FT              Data Scientist
2 1    2020      SE               FT              Machine Learning Scientist
3 2    2020      SE               FT              Big Data Engineer
4 3    2020      MI               FT              Product Data Analyst
5 4    2020      SE               FT              Machine Learning Engineer
6 5    2020      EN               FT              Data Analyst
  salary salary_currency salary_in_usd employee_residence remote_ratio
1  70000 EUR              79833        DE                   0
2 260000 USD             260000        JP                   0
3  85000 GBP             109024        GB                  50
4  20000 USD              20000        HN                   0
5 150000 USD             150000        US                  50
6  72000 USD              72000        US                 100
  company_location company_size
1 DE               L
2 JP               S
3 GB               M
4 HN               S
5 US               L
6 US               L

In [58]:
# cleaning the data
clean_data <- original_data %>%
    filter(!is.na(salary_in_usd),
        employee_residence %in% c("CA", "GB"),
            employment_type == "FT") %>%
    select(salary_in_usd, employee_residence, job_title, experience_level)

head(clean_data)

  salary_in_usd employee_residence job_title                experience_level
1 109024        GB                 Big Data Engineer        SE
2 117104        CA                 Machine Learning Manager SE
3 112872        GB                 Data Engineer            MI
4  76958        GB                 Data Scientist           MI
5  82528        GB                 Research Scientist       EN
6  54238        GB                 Applied Data Scientist   MI

In [59]:

ca_salary_mean <- 
    clean_data %>%
    filter(employee_residence == "CA") %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

ca_salary_mean

gb_salary_mean <-
    clean_data %>%
    filter(employee_residence == "GB") %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

gb_salary_mean

us_salary_plot <-
    clean_data %>%
    filter(employee_residence == "US") %>%
    ggplot(aes(x = salary_in_usd)) + 
    geom_histogram(binwidth = 5000, color="white") +
    xlab("salary in usd") +
    ggtitle("distribution of salaries in the US")



gb_salary_plot <-
    clean_data %>%
    filter(employee_residence == "GB") %>%
    ggplot(aes(x = salary_in_usd)) + 
    geom_histogram(binwidth = 10000, color="white") +
    xlab("salary in usd") +
    ggtitle("distribution of salaries in GB")


plot_salaries <- plot_grid(us_salary_plot +
                theme(axis.text.x = element_text(angle = 90)) +
                scale_x_continuous(breaks = seq(40000, 120000, 200000),
                                   limits = c(20000, 500000)),
                gb_salary_plot + 
                theme(axis.text.x = element_text(angle = 90)) +
                scale_x_continuous(breaks = seq(40000, 120000, 200000),
                                   limits = c(20000, 220000)),
                ncol = 2)

title <- ggdraw() +
    draw_label("Comparison of sample distribution of data science salaries",
                fontface = 'bold',
                x = 0,
                hjust = 0) +
    theme(plot.margin = margin(0, 0, 0, 7))

salary_grid <- plot_grid(title, plot_salaries, ncol = 1, rel_heights = c(0.1, 1))

#salary_grid

[1] 96981.21

[1] 81403.16

Warning message:
“Removed 2 rows containing missing values (geom_bar).”

In [50]:
number_small <- original_data %>%
    summarise(number_small = sum(company_size == "S")) %>%
    pull()

number_medium <- original_data %>%
    summarise(number_medium = sum(company_size == "M")) %>%
    pull()

number_large <- original_data %>%
    summarise(number_large = sum(company_size == "L")) %>%
    pull()

number_small
number_medium
number_large

[1] 83

[1] 326

[1] 198

In [55]:
clean_data2 <- original_data %>%
    filter(!is.na(salary_in_usd),
            employment_type == "FT") %>%
    select(salary_in_usd, employee_residence, job_title, experience_level, company_size)

head(clean_data2)

  salary_in_usd employee_residence job_title                  experience_level
1  79833        DE                 Data Scientist             MI
2 260000        JP                 Machine Learning Scientist SE
3 109024        GB                 Big Data Engineer          SE
4  20000        HN                 Product Data Analyst       MI
5 150000        US                 Machine Learning Engineer  SE
6  72000        US                 Data Analyst               EN
  company_size
1 L
2 S
3 M
4 S
5 L
6 L

In [56]:
small_salary_mean <- 
    clean_data2 %>%
    filter(company_size == "S") %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

medium_salary_mean <- 
    clean_data2 %>%
    filter(company_size == "M") %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

large_salary_mean <- 
    clean_data2 %>%
    filter(company_size == "L") %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

small_salary_mean
medium_salary_mean
large_salary_mean

[1] 76484

[1] 118662.1

[1] 119665.4

In [60]:
ca_salary_median <- 
    clean_data %>%
    filter(employee_residence == "CA") %>%
    summarise(median_salary = median(salary_in_usd)) %>%
    pull()

gb_salary_median <-
    clean_data %>%
    filter(employee_residence == "GB") %>%
    summarise(median_salary = median(salary_in_usd)) %>%
    pull()

ca_salary_median
gb_salary_median

[1] 81895.5

[1] 78526

In [61]:
number_remote_ratio_0 <- original_data %>%
    summarise(number = sum(remote_ratio == 0)) %>%
    pull()

number_remote_ratio_50 <- original_data %>%
    summarise(number= sum(remote_ratio == 50)) %>%
    pull()

number_remote_ratio_100 <- original_data %>%
    summarise(number = sum(remote_ratio == 100)) %>%
    pull()

number_remote_ratio_0
number_remote_ratio_50
number_remote_ratio_100

[1] 127

[1] 99

[1] 381

In [64]:
clean_data3 <- original_data %>%
    filter(!is.na(salary_in_usd),
            employment_type == "FT") %>%
    select(salary_in_usd, employee_residence, job_title, experience_level, remote_ratio)

head(clean_data3)

  salary_in_usd employee_residence job_title                  experience_level
1  79833        DE                 Data Scientist             MI
2 260000        JP                 Machine Learning Scientist SE
3 109024        GB                 Big Data Engineer          SE
4  20000        HN                 Product Data Analyst       MI
5 150000        US                 Machine Learning Engineer  SE
6  72000        US                 Data Analyst               EN
  remote_ratio
1   0
2   0
3  50
4   0
5  50
6 100

In [66]:
remote_ratio_0_mean <- 
    clean_data3 %>%
    filter(remote_ratio == 0) %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

remote_ratio_50_mean <- 
    clean_data3 %>%
    filter(remote_ratio == 50) %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

remote_ratio_100_mean <- 
    clean_data3 %>%
    filter(remote_ratio == 100) %>%
    summarise(mean_salary = mean(salary_in_usd)) %>%
    pull()

remote_ratio_0_mean
remote_ratio_50_mean
remote_ratio_100_mean

[1] 107040

[1] 84440.02

[1] 122874.9

In [67]:
remote_ratio_0_median <- 
    clean_data3 %>%
    filter(remote_ratio == 0) %>%
    summarise(median_salary = median(salary_in_usd)) %>%
    pull()

remote_ratio_50_median <- 
    clean_data3 %>%
    filter(remote_ratio == 50) %>%
    summarise(median_salary = median(salary_in_usd)) %>%
    pull()

remote_ratio_100_median <- 
    clean_data3 %>%
    filter(remote_ratio == 100) %>%
    summarise(median_salary = median(salary_in_usd)) %>%
    pull()

remote_ratio_0_median
remote_ratio_50_median
remote_ratio_100_median

[1] 99000

[1] 71562

[1] 115717